from time import sleep

print('Сейчас 22:00')
sleep(2)
print("Завтра надо сдавать квест. Ваши действия?")
sleep(2)
print("""
1. Написать программу, с которой не надо будет прописывать каждый if и print вручную
2. Написать квест как все нормальные люди
3. Подклюиться к дискорд серверу
""")
a = int(input("Введите число от 1 до 3"))
if a == 1:
    sleep(2)
    print('Вы открыли старый файл.')
    print('До осознания, что запустить написанную гениальным образом игру вы не сможете осталось:')
    for i in range(0, 216000):
        print(f'\x1b[34m\r{216000 - i} секунд \x1b[0m', end='')
        sleep(1)
    sleep(2)
    print("Вы ели грибы последние 2 часа?")
    b = input('да/нет')
    print("понятно...")
    sleep(2)
    print("Видно, что ели")
    sleep(2)
    print("Вот почему главный фактор производства интеллигенции адвокатировали 1.5 миллиона массового состава")
    print('Вы как обычно проснулись в холодильнике, привязанному к потолку')
elif a == 2:
    sleep(2)
    print('Вы пишите...')
    sleep(2)
    print('Вас зовут в дискорд')
    sleep(2)
    d = input("Подключиться? да/нет")
    if d == 'да':
        sleep(2)
        print('Вы подключаетесь к серверу')
        sleep(2)
        print("Лев опять затирает про политику")
        sleep(2)
        c = input('Выключить ему микрофон? (да/нет)')
        print('Хорошо, что вы решили отключить микрофон')
        sleep(2)
        print("Желание совершить грех потихоньку уходит")
        sleep(2)
        print("...")
        sleep(2)
        print("Вы ели грибы последние 2 часа?")
        c = input()
        print("понятно...")
        sleep(2)
        print("Видно, что ели")
        sleep(2)
        print("Вот почему главный фактор производства интеллигенции адвокатировали 1.5 миллиона массового состава")
        print('Вы как обычно проснулись в холодильнике, привязанному к потолку')
    else:
        print('Не, так не интересно')
        sleep(2)
        print('Вы подключаетесь к серверу')
        sleep(2)
        print("Лев опять затирает про политику")
        sleep(2)
        c = input('Выключить ему микрофон? (да/нет)')
        print('Хорошо, что вы решили отключить микрофон')
        sleep(2)
        print("Желание совершить грех потихоньку уходит")
        sleep(2)
        print("...")
        sleep(2)
        print("Вы ели грибы последние 2 часа?")
        c = input()
        print("понятно...")
        sleep(2)
        print("Видно, что ели")
        sleep(2)
        print("Вот почему главный фактор производства интеллигенции адвокатировали 1.5 миллиона массового состава")
        print('Вы как обычно проснулись в холодильнике, привязанному к потолку')


elif a == 3:
    sleep(2)
    print('Вы подключаетесь к серверу')
    sleep(2)
    print("Лев опять затирает про политику")
    sleep(2)
    c = input('Выключить ему микрофон? (да/нет)')
    print('Хорошо, что вы решили отключить микрофон')
    sleep(2)
    print("Желание совершить грех потихоньку уходит")
    sleep(2)
    print("...")
    sleep(2)
    print("Вы ели грибы последние 2 часа?")
    c = input()
    print("понятно...")
    sleep(2)
    print("Видно, что ели")
    sleep(2)
    print("Вот почему главный фактор производства интеллигенции адвокатировали 1.5 миллиона массового состава")
    print('Вы как обычно проснулись в холодильнике, привязанному к потолку')
